app/views/folders/_form.html.erb

SELECT "resources"."id" FROM "resources" INNER JOIN "folders_resources" ON "resources"."id" = "folders_resources"."resource_id" WHERE "folders_resources"."folder_id" = $1  [["folder_id", 6]]
---
  <%= f.label :resource %>
  <%= f.select :resource_ids, Resource.pluck(:title, :id), :include_blank => true %>