app/views/folders/index.html.erb

SELECT "folders".* FROM "folders" WHERE "folders"."user_id" = $1  [["user_id", 5]]
---

  <p> <% @current_user.folders.each do |folder|%> </p>