app/views/folders/show.html.erb

  <li>Name: <%= @folder.name %></li>
   <% if @folder.resources.present? %>
---
SELECT "resources".* FROM "resources" INNER JOIN "folders_resources" ON "resources"."id" = "folders_resources"."resource_id" WHERE "folders_resources"."folder_id" = $1  [["folder_id", 10]]