app/views/resources/_form.html.erb

<%= f.label :subject_id %>
<%= f.select :subject_id, Subject.pluck(:name, :id) %>
---
SELECT "subjects"."name", "subjects"."id" FROM "subjects"