app/views/resources/index.html.erb

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
     <li>Kind : <%= resource.kind %></li>
     <% if resource.subject.present? %>