app/views/resources/show.html.erb

SELECT "folders".* FROM "folders" INNER JOIN "folders_resources" ON "folders"."id" = "folders_resources"."folder_id" WHERE "folders_resources"."resource_id" = $1  [["resource_id", 24]]
---
<ul>
  <% if @resource.folders.present? %>
    <% @resource.folders.each do |l| %>