app/controllers/folders_controller.rb

  def index
    @folders = Folder.all
---
SELECT "folders".* FROM "folders"

  def create
    folderdata = folder_params
    folder = Folder.create folderdata
    resource = Resource.find_by :id => folderdata[:resource_ids]
    folder.resources << resource
---
INSERT INTO "folders" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "finish"], ["user_id", 9], ["created_at", "2019-11-08 00:55:04.628000"], ["updated_at", "2019-11-08 00:55:04.628000"]]
SELECT "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "folders" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "amanda"], ["user_id", 9], ["created_at", "2019-11-08 00:47:48.683511"], ["updated_at", "2019-11-08 00:47:48.683511"]]

  def edit
  @folder = Folder.find params[:id]
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

  def update
    folder = Folder.find params[:id]
    folder.update folder_params
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "folders" SET "name" = $1, "updated_at" = $2 WHERE "folders"."id" = $3  [["name", "Lizzys Algebra"], ["updated_at", "2019-11-06 03:05:31.132736"], ["id", 22]]

  def show
    @folder = Folder.find params[:id]
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

  def destroy
    folder = Folder.find params[:id]
    folder.destroy
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "folders" WHERE "folders"."id" = $1  [["id", 23]]