app/controllers/resources_controller.rb

  def edit
    @resource = Resource.find params[:id]
---
SELECT "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    resource = Resource.find params[:id]
    resource.update resource_params
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      resource.image = req["public_id"]
    end
      resource.update_attributes(resource_params)
      resource.save
---
SELECT "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "resources" SET "title" = $1, "subject_id" = $2, "updated_at" = $3 WHERE "resources"."id" = $4  [["title", "raise Hello"], ["subject_id", 3], ["updated_at", "2019-11-06 01:33:51.822604"], ["id", 13]]
UPDATE "resources" SET "image" = $1, "updated_at" = $2 WHERE "resources"."id" = $3  [["image", "hhj1dd1owubvsjuevtz4"], ["updated_at", "2019-11-06 01:55:11.204511"], ["id", 15]]
UPDATE "resources" SET "image" = $1, "updated_at" = $2 WHERE "resources"."id" = $3  [["image", "qq2sxdpvaxoijbpbh8fk"], ["updated_at", "2019-11-06 00:04:37.476020"], ["id", 10]]

  def create
    @resource = Resource.create resource_params
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      @resource.image = req["public_id"]
      @resource.save
---
INSERT INTO "resources" ("title", "kind", "subject_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "testing me"], ["kind", "image"], ["subject_id", 4], ["created_at", "2019-11-06 01:46:13.889252"], ["updated_at", "2019-11-06 01:46:13.889252"]]
UPDATE "resources" SET "image" = $1, "updated_at" = $2 WHERE "resources"."id" = $3  [["image", "ezggrg2vuyupccejjowv"], ["updated_at", "2019-11-06 01:46:31.300927"], ["id", 15]]

  def show
    @resource = Resource.find params[:id]
---
SELECT "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def destroy
    resource = Resource.find params[:id]
    resource.destroy
---
SELECT "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "resources" WHERE "resources"."id" = $1  [["id", 15]]