app/controllers/session_controller.rb

  def create
    #reteieve user
    user = User.find_by :email => params[:email]
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "adony@ga.com"], ["LIMIT", 1]]